app/views/subs/show.html.erb

<%= @sub.description%>
<%= User.find_by(id: @sub.moderator_id).username %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]