app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def require_moderator
        sub = Sub.find_by(id: params[:id])

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "Bluebirds Fly!"], ["updated_at", "2019-04-09 22:24:49.688263"], ["id", 1]]
---
    def update
        @sub = Sub.find_by(id: params[:id])
        if @sub.update(sub_params)