app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "-yCo4AYCjS8YUSoHqM6UOA"], ["updated_at", "2019-04-09 23:51:36.969305"], ["id", 3]]
---
    def reset_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save!